Chimipupu/rp2350_dev/src/rp2xxx_dev/dbg_com.c
/**
 * @file dbg_com.c
 * @author Chimipupu(https://github.com/Chimipupu)
 * @brief デバッグモニタのアプリ
 * @version 0.1
 * @date 2025-06-13
 * 
 * @copyright Copyright (c) 2025 Chimipupu All Rights Reserved.
 * 
 */
#include "dbg_com.h"
#include "rp2350_util.h"
#include "pcb_def.h"
#include "app_main.h"
#include "app_math.h"
#include "rp2350_util.h"

#include "drv_neopixel.h"
extern neopixel_t s_neopixel;

// コマンド履歴
static char s_cmd_history[CMD_HISTORY_MAX][DBG_CMD_MAX_LEN];
static uint8_t s_history_count = 0;  // コマンド履歴の数
static int8_t s_history_pos = -1;    // 現在の履歴位置（-1は最新）

// コマンドテーブル
#if defined(MCU_RP2040)
#define CMD_TBL_SIZE    12
const dbg_cmd_info_t g_cmd_tbl[] = {
//  | コマンド文字列 | コマンド種類 | 説明 | 最小引数数 | 最大引数数 |
    {"help",      CMD_HELP,       "Show this help message", 0, 0},
    {"cls",       CMD_CLS,        "Display Clear", 0, 0},
    {"sys",       CMD_SYSTEM,     "Show system information", 0, 0},
    {"rst",       CMD_RST,        "Reboot", 0, 0},
    {"memd",      CMD_MEM_DUMP,    "Memory Dump Command. args -> (#address, length)", 2, 2},
    {"reg",       CMD_REG,        "Register read/write: reg #addr r|w bits [#val]", 3, 4},
    {"i2c",       CMD_I2C,        "I2C control (port, command)", 2, 2},
    {"gpio",      CMD_GPIO,       "Control GPIO pin (pin, value)", 2, 2},
    {"px",        CMD_NEOPIXEL,   "Control NeoPixel (command, args)", 1, 2},
    {"tm",        CMD_TIMER,      "Set timer alarm (seconds)", 0, 1},
    {"mt",        CMD_MT_TEST,    "Math test", 0, 0},
    {"mct",       CMD_MCT,        "Multi Core test", 0, 0},
};

#elif defined(MCU_RP2350)
#define CMD_TBL_SIZE    14
const dbg_cmd_info_t g_cmd_tbl[] = {
//  | コマンド文字列 | コマンド種類 | 説明 | 最小引数数 | 最大引数数 |
    {"help",      CMD_HELP,       "Show this help message", 0, 0},
    {"cls",       CMD_CLS,        "Display Clear", 0, 0},
    {"sys",       CMD_SYSTEM,     "Show system information", 0, 0},
    {"rst",       CMD_RST,        "Reboot", 0, 0},
    {"memd",      CMD_MEM_DUMP,    "Memory Dump Command. args -> (#address, length)", 2, 2},
    {"reg",       CMD_REG,        "Register read/write: reg #addr r|w bits [#val]", 3, 4},
    {"i2c",       CMD_I2C,        "I2C control (port, command)", 2, 2},
    {"gpio",      CMD_GPIO,       "Control GPIO pin (pin, value)", 2, 2},
    {"px",        CMD_NEOPIXEL,   "Control NeoPixel (command, args)", 1, 2},
    {"tm",        CMD_TIMER,      "Set timer alarm (seconds)", 0, 1},
    {"rnd",       CMD_RND,        "Generate true random numbers using TRNG", 0, 1},
    {"sha",       CMD_SHA,        "Calc SHA-256 Hash using H/W Accelerator", 0, 1},
    {"mt",        CMD_MT_TEST,    "Math test", 0, 0},
    {"mct",       CMD_MCT,        "Multi Core test", 0, 0},
};
#endif

static void sort_available_orders(void);
static void dbg_com_init_msg(void);
static void cmd_help(void);
static void cmd_cls(void);
static void cmd_system(void);
static void cmd_mt_test(void);
static void cmd_mct_test(void);
static void cmd_pi_calc(const dbg_cmd_args_t* p_args);

#if defined(MCU_RP2350)
static void cmd_rnd(const dbg_cmd_args_t* p_args);
static void cmd_sha(const dbg_cmd_args_t* p_args);
#endif

static void cmd_rst(void);
static void cmd_unknown(void);
static void cmd_timer(const dbg_cmd_args_t* p_args);
static void cmd_gpio(const dbg_cmd_args_t* p_args);
static void cmd_mem_dump(const dbg_cmd_args_t* p_args);
static void cmd_i2c(const dbg_cmd_args_t* p_args);
static void cmd_reg(const dbg_cmd_args_t* p_args);
static void cmd_neopixel(const dbg_cmd_args_t* p_args);

// コマンドバッファ
static char s_cmd_buffer[DBG_CMD_MAX_LEN];
static int32_t s_cmd_index = 0;

// タイマー状態
static timer_state_t s_timer_state[TIMER_MAX_ALARMS] = {0};
static uint8_t s_available_orders[TIMER_MAX_ALARMS] = {1, 2, 3, 4};  // 利用可能な登録順序
static uint8_t s_available_count = TIMER_MAX_ALARMS;  // 利用可能な登録順序の数

static int32_t split_str(char* p_str, dbg_cmd_args_t* p_args);

static int get_neopixel_color_from_name(const char* name);
static int parse_hex_color(const char* str, uint8_t *r, uint8_t *g, uint8_t *b);

// コマンド引数を分割して解析
static int32_t split_str(char* p_str, dbg_cmd_args_t* p_args)
{
    char* p_token;
    char* p_next = p_str;
    char* p_end = p_str + strlen(p_str);

    p_args->argc = 0;
#ifdef DEBUG_DBG_COM
    printf("[DEBUG] : Input string = '%s'\n", p_str);  // 入力文字列の確認
#endif // DEBUG_DBG_COM

    while (p_next < p_end && p_args->argc < DBG_CMD_MAX_ARGS)
    {
        // スペースをスキップ
        while (*p_next == ' ' && p_next < p_end)
        {
            p_next++;
        }
        if (p_next >= p_end) break;

        // トークンの開始位置を記録
        p_token = p_next;

        // 次のスペースまたは文字列末尾まで移動
        while (*p_next != ' ' && p_next < p_end)
        {
            p_next++;
        }

        // 文字列を終端
        if (*p_next == ' ') {
            *p_next++ = '\0';
        }

#ifdef DEBUG_DBG_COM
        printf("[DEBUG] : Next token = '%s'\n", p_token);
#endif // DEBUG_DBG_COM
        p_args->p_argv[p_args->argc++] = p_token;
        WDT_RST();
    }

#ifdef DEBUG_DBG_COM
    printf("[DEBUG] : argc = %d\n", p_args->argc);
    for (int i = 0; i < p_args->argc; i++)
    {
        printf("[DEBUG] : argv[%d] = %s\n", i, p_args->p_argv[i]);
    }
#endif // DEBUG_DBG_COM

    return p_args->argc;
}

// タイマーコールバック関数
static int64_t timer_callback(alarm_id_t id, void *user_data)
{
    // 対応するタイマーを探して状態を更新
    for (int i = 0; i < TIMER_MAX_ALARMS; i++)
    {
        if (s_timer_state[i].alarm_id == id) {
            printf("\nTimer #%d Alarm! (Set time : %d)\n", i + 1, s_timer_state[i].req_time_sec);

            // 登録順序を再利用可能なリストに戻す
            s_available_orders[s_available_count++] = s_timer_state[i].reg_order;
            sort_available_orders();  // 利用可能な登録順序を昇順にソート
            s_timer_state[i].is_running = false;
            s_timer_state[i].alarm_id = 0;
            s_timer_state[i].reg_order = 0;
            break;
        }
    }

    printf("> ");

    return 0;  // 繰り返しなし
}

// 利用可能な登録順序を昇順にソート
static void sort_available_orders(void)
{
    for (int i = 0; i < s_available_count - 1; i++)
    {
        for (int j = 0; j < s_available_count - i - 1; j++)
        {
            if (s_available_orders[j] > s_available_orders[j + 1]) {
                uint8_t temp = s_available_orders[j];
                s_available_orders[j] = s_available_orders[j + 1];
                s_available_orders[j + 1] = temp;
            }
        }
    }
}

