Chimipupu/rp2350_dev/src/rp2xxx_dev/dbg_com.c
static void dbg_com_init_msg(void)
{
    printf("\nDebug Command Monitor for %s Ver%d.%d.%d\n",MCU_NAME,
                                                        FW_VERSION_MAJOR,
                                                        FW_VERSION_MINOR,
                                                        FW_VERSION_REVISION);
    printf("Copyright (c) 2025 Chimipupu All Rights Reserved.\n");
    printf("Type 'help' for available commands\n");
#ifdef _WDT_ENABLE_
    printf("[INFO] Wanning! WDT Enabled: %dms\n", _WDT_OVF_TIME_MS_);
#endif // _WDT_ENABLE_
}

static void cmd_help(void)
{
    dbg_com_init_msg();

    printf("\nAvailable commands:\n");
    for (uint8_t i = 0; i < CMD_TBL_SIZE; i++)
    {
        printf("  %-10s - %s\n", g_cmd_tbl[i].p_cmd_str, g_cmd_tbl[i].p_description);
    }
}

static void cmd_cls(void)
{
    printf(ANSI_ESC_CLS);
}

static void cmd_system(void)
{
    uint32_t sys_clock, usb_clock, adc_clock, ref_clock;
    float cpu_temp;

    printf("\n[System Information]\n");

    // Pico SDK
    pico_sdk_version_print();

    // 基板
    printf("\n[PCB Info]\nPCB Name : %s\n", PCB_NAME);

    // マイコン
    cpu_temp = get_cpu_temp_from_adc();
    printf("MCU : %s\n", MCU_NAME);
#if defined(MCU_RP2040)
    printf("CPU : Arm Cortex-M0+ (DualCore)\n");
#elif defined(MCU_RP2350)
    printf("CPU : Arm Cortex-M33 (DualCore)\n");
    rp2xxx_chip_package_print();    // チップパッケージ
#endif
    rp2xxx_chip_rev_print();        // チップRev
    printf("CPU temp = %.02f℃\n", cpu_temp);

    // レジスタ表示
    rp2xxx_reg_info();

    // ROM/RAM
    printf("\n[Mem Info]\n");
    printf("Flash Size : %d MB\n", MCU_FLASH_SIZE);
    printf("RAM Size : %d KB\n", MCU_RAM_SIZE);
#if defined(PCB_PSRAM_ENABLE)
    printf("PSRAM Size : %d MB\n", MCU_PSRAM_SIZE);
#endif // MCU_PSRAM_SIZE

    // クロック関連
    printf("\n[Clock Info]\n");
#if 0
    uint32_t clk_gp0, clk_gp1, clk_gp2, clk_gp3;
    clk_gp0 = clock_get_hz(clk_gpout0) / 1000000;
    clk_gp1 = clock_get_hz(clk_gpout1) / 1000000;
    clk_gp2 = clock_get_hz(clk_gpout2) / 1000000;
    clk_gp3 = clock_get_hz(clk_gpout3) / 1000000;
    printf("CLK_GPOUT0 : %d MHz\n", clk_gp0);
    printf("CLK_GPOUT1 : %d MHz\n", clk_gp1);
    printf("CLK_GPOUT2 : %d MHz\n", clk_gp2);
    printf("CLK_GPOUT3 : %d MHz\n", clk_gp3);
#endif
    ref_clock = clock_get_hz(clk_ref) / 1000000;
    sys_clock = clock_get_hz(clk_sys) / 1000000;
    usb_clock = clock_get_hz(clk_usb) / 1000000;
    adc_clock = clock_get_hz(clk_adc) / 1000000;
    printf("CLK_REF : %d MHz\n", ref_clock);
    printf("CLK_SYS : %d MHz\n", sys_clock);
    printf("CLK_USB : %d MHz\n", usb_clock);
    printf("CLK_ADC : %d MHz\n", adc_clock);

    // GPIO
    printf("\n[GPIO Info]\n");
#if defined(PCB_WEACT_RP2350A_V10)
    printf("GPIO %d : On Board Green LED Pin\n", PCB_LED_PIN);
    printf("GPIO %d : On Board Blue LED Pin\n", PCB_LED_2_PIN);
#else
    printf("GPIO %d : On Board LED Pin\n", PCB_LED_PIN);
#endif

#if defined(PCB_BTN_PIN)
    printf("GPIO %d : On Board Button Pin\n", PCB_BTN_PIN);
#endif

#ifdef PCB_NEOPIXEL
    printf("GPIO %d : NeoPixel Data Pin\n", PCB_NEOPIXEL_PIN);
    printf("NeoPixel Count : %d\n", NEOPIXEL_LED_CNT);
#endif // PCB_NEOPIXEL

    // I2C
    printf("\n[I2C Info]\n");
    printf("I2C 0 : %d bps, SDA/SCL (GPIO %d/%d)\n",
            I2C_BIT_RATE, I2C_0_SDA, I2C_0_SCL);
    printf("I2C 1 : %d bps, SDA/SCL (GPIO %d/%d)\n",
            I2C_BIT_RATE, I2C_1_SDA, I2C_1_SCL);

    // SPI
    printf("\n[SPI Info]\n");
    printf("SPI 0 : %d bps, CS/SCK/MISO/MOSI(GPIO %d/%d/%d/%d)\n",
            SPI_BIT_RATE, SPI_0_CS, SPI_0_SCK, SPI_0_MISO, SPI_0_MOSI);
    printf("SPI 1 : %d bps, CS/SCK/MISO/MOSI(GPIO %d/%d/%d/%d)\n",
            SPI_BIT_RATE, SPI_1_CS, SPI_1_SCK, SPI_1_MISO, SPI_1_MOSI);
    // UART
    printf("\n[UART Info]\n");
    printf("UART 0 : %d bps 8N1, TX/RX (GPIO %d%d)\n",
            UART_BAUD_RATE, UART_0_TX, UART_0_RX);
    printf("UART 1 : %d bps 8N1, TX/RX (GPIO %d%d)\n",
            UART_BAUD_RATE, UART_1_TX, UART_1_RX);
}

static void cmd_mt_test(void)
{
    // 数学関連テスト
    app_math_math_test();

    // 四則演算テスト(inr,float,double)
    printf("\nInteger Arithmetic Test: @%d\n", TEST_LOOP_CNT);
    proc_exec_time(int_add_test, "int_add_test");
    proc_exec_time(int_sub_test, "int_sub_test");
    proc_exec_time(int_mul_test, "int_mul_test");
    proc_exec_time(int_div_test, "int_div_test");

    printf("\nFloat Arithmetic Tests: @%d\n", TEST_LOOP_CNT);
    proc_exec_time(float_add_test, "float_add_test");
    proc_exec_time(float_sub_test, "float_sub_test");
    proc_exec_time(float_mul_test, "float_mul_test");
    proc_exec_time(float_div_test, "float_div_test");

    printf("\nDouble Arithmetic Tests: @%d\n", TEST_LOOP_CNT);
    proc_exec_time(double_add_test, "double_add_test");
    proc_exec_time(double_sub_test, "double_sub_test");
    proc_exec_time(double_mul_test, "double_mul_test");
    proc_exec_time(double_div_test, "double_div_test");
}

static void cmd_mct_test(void)
{
    uint32_t data = 0;

    // Core1からCore0にテストデータを投げる
    data = MULTI_CORE_TEST_DATA;
    set_multicore_fifo(data);
    printf("[Core 1] TX FIFO Data to Core 0 : 0x%08X\n", data);
}

static void cmd_pi_calc(const dbg_cmd_args_t* p_args)
{
    int32_t iterations = 3;
    volatile double pi;

    if (p_args->argc > 1) {
        iterations = atoi(p_args->p_argv[1]);
        if (iterations <= 0) {
            printf("Error: Invalid iteration count. Must be positive.\n");
            return;
        }
    }

    printf("\nCalculating Pi using Gauss-Legendre algorithm (%d iterations):\n", iterations);
    for (uint32_t i = 1; i <= iterations; i++)
    {
        volatile uint32_t start_time = time_us_32();
        pi = app_math_pi_calc(i);
        volatile uint32_t end_time = time_us_32();
        printf("Iteration %d: π ≈ %.15f (proc time: %u us)\n", i, pi, end_time - start_time);
    }
}

#if defined(MCU_RP2350)
static void cmd_sha(const dbg_cmd_args_t* p_args)
{
    uint8_t padding_buf[64 * 2];
    uint8_t hash_buf[64 * 2];
    size_t padding_len;

