Chimipupu/rp2350_dev/src/rp2xxx_dev/dbg_com.c
    if (p_args->argc < 2 || p_args->argc > 2) {
        printf("Usage: sha <data>\n");
        return;
    }

    memset(hash_buf, 0, sizeof(hash_buf));
    memset(padding_buf, 0, sizeof(padding_buf));

#if 1
    char *msg;
    msg = p_args->p_argv[1];
#else
    // (DEBUG)
    // const char msg[] = "RP2350 H/W SHA-256 TEST";    // SHA256期待値「40AEDCA712E82FD6128B6A9AFCA1350ABA27AC1259E92AE3BADE0C0C4FE892E2」
    const char msg[] = "ABC";                        // SHA256期待値「B5D4045C3F466FA91FE2CC6ABE79232A1A57CDF104F7A26E716E0A1E2789DF78」
#endif

    printf("\nSHA-256 Hash Calc(H/W)\n");
    printf("\nCalc str : %s\n", msg);
    // SHA-256のパディング処理
    sha256_padding((const uint8_t *)msg, strlen(msg), padding_buf, &padding_len);
    show_mem_dump((uint32_t)padding_buf, 64);

    // SHA-256のハッシュ値を計算
    hardware_calc_sha256((const uint8_t *)padding_buf, padding_len, hash_buf);
    printf("\nSHA-256 Hash : ");
    for (size_t i = 0; i < 32; ++i)
    {
        printf("%02X", hash_buf[i]);
    }
    printf("\n");
    show_mem_dump((uint32_t)hash_buf, 64);
}

static void cmd_rnd(const dbg_cmd_args_t* p_args)
{
    int32_t i, count;

    if (p_args->argc < 2 || p_args->argc > 2) {
        printf("Usage: rnd <count>\n");
        return;
    }

    count = atoi(p_args->p_argv[1]);
    uint32_t rand_buf[count];
    memset(rand_buf, 0, sizeof(rand_buf));
    if (count <= 0) {
        printf("Error: Invalid count. Must be positive.\n");
        return;
    }

    // TRNGで真性乱数を生成
    printf("\nTRANG gen random num cnt:%d\n", count);
    trang_gen_rand_num_u32(rand_buf, count);

#if 1
    for (i = 0; i < count; i++)
    {
        printf("[DEBUG]generated rand num(%d): %u\n", i, rand_buf[i]);
    }
#endif

    printf("\n");
}
#endif

static void cmd_rst(void)
{
    printf("Resetting system...\n");
    watchdog_reboot(0, 0, 0);   // WDTで即時リセット
}

static void cmd_unknown(void)
{
    printf("Unknown command. Type 'help' for available commands.\n");
}

/**
 * @brief タイマーコマンド関数
 * 
 * @param p_args コマンド引数の構造体ポインタ
 */
static void cmd_timer(const dbg_cmd_args_t* p_args)
{
    if (p_args->argc > 1) {
        int32_t seconds = atoi(p_args->p_argv[1]);
        if (seconds <= 0) {
            printf("Error: Invalid timer duration. Must be positive.\n");
            return;
        }
        if (seconds > TIMER_MAX_SECONDS) {
            printf("Error: Timer duration exceeds maximum of %d seconds.\n", TIMER_MAX_SECONDS);
            return;
        }

        // 空いているタイマースロットを探す
        int free_slot = -1;
        for (int i = 0; i < TIMER_MAX_ALARMS; i++)
        {
            if (!s_timer_state[i].is_running) {
                free_slot = i;
                break;
            }
        }

        if (free_slot == -1) {
            printf("Error: All %d hardware timers are in use.\n", TIMER_MAX_ALARMS);
            return;
        }

        // H/Wでアラームを設定（us単位）
        s_timer_state[free_slot].req_time_sec = seconds;
        uint64_t delay_us = seconds * 1000000ULL;
        alarm_id_t alarm_id = add_alarm_in_us(delay_us, timer_callback, NULL, true);
        if (alarm_id > 0) {
            s_timer_state[free_slot].is_running = true;
            s_timer_state[free_slot].start_time = time_us_32();
            s_timer_state[free_slot].duration = delay_us;
            s_timer_state[free_slot].alarm_id = alarm_id;
            // 利用可能な登録順序から最小のものを使用
            s_timer_state[free_slot].reg_order = s_available_orders[0];
            // 使用した登録順序を削除し、残りを前に詰める
            for (int i = 0; i < s_available_count - 1; i++) {
                s_available_orders[i] = s_available_orders[i + 1];
            }
            s_available_count--;
            printf("Timer #%d Alarm Set %d s\n",free_slot + 1, seconds);
        } else {
            printf("Error: Failed to set timer.\n");
        }
    } else {
        // 引数なしの場合は現在のタイマー状態を表示
        bool any_running = false;
        for (int i = 0; i < TIMER_MAX_ALARMS; i++) {
            if (s_timer_state[i].is_running) {
                uint32_t elapsed = time_us_32() - s_timer_state[i].start_time;
                uint32_t remaining = (elapsed < s_timer_state[i].duration) ?
                                    (s_timer_state[i].duration - elapsed) : 0;
                printf("Timer #%d (alarm as #%d) : %u s remaining.\n",
                        i + 1, s_timer_state[i].reg_order,
                       (remaining + 500000) / 1000000);  // 四捨五入
                any_running = true;
            }
        }
        if (!any_running) {
            printf("No timers are running.\n");
        }
    }
}

/**
 * @brief GPIO制御コマンド関数
 * 
 * @param p_args コマンド引数の構造体ポインタ
 */
static void cmd_gpio(const dbg_cmd_args_t* p_args)
{
    if (p_args->argc != 3) {
        printf("Error: Invalid number of arguments. Usage: gpio <pin> <value>\n\n");
        return;
    }

    // コマンドからGPIOのピン番号とピンの値を取得
    uint8_t pin = atoi(p_args->p_argv[1]);
    uint8_t value = atoi(p_args->p_argv[2]);

    // GPIOのピン番号チェック
    if (pin < 0 || pin > GPIO_MAX_PIN_NUM) {
        printf("Error: Invalid GPIO pin number. Must be between 0 and %d.\n\n", GPIO_MAX_PIN_NUM);
        return;
    }

    // Low/High以外は受け付けない
    if (value != 0 && value != 1) {
        printf("Error: Invalid GPIO value. Must be 0 or 1.\n\n");
        return;
    }

    // GPIOの初期化と設定
    gpio_init(pin);
    gpio_set_dir(pin, GPIO_OUT);

    // GPIO操作の処理時間を計測
    volatile uint32_t start_time = time_us_32();
    gpio_put(pin, value);
    volatile uint32_t end_time = time_us_32();

    printf("GPIO %d set to %d (proc time: %u us)\n\n", pin, value, end_time - start_time);
}

/**
 * @brief メモリダンプコマンド関数
 * 
 * @param p_args コマンド引数の構造体ポインタ
 */
static void cmd_mem_dump(const dbg_cmd_args_t* p_args)
{
    uint32_t addr;
    uint32_t length;

    if (p_args->argc != 3) {
        printf("Error: Invalid number of arguments. Usage: mem_dump <address> <length>\n");
        return;
    }

    // アドレスを16進数文字列から数値に変換
    if (sscanf(p_args->p_argv[1], "#%x", &addr) != 1) {
        printf("Error: Invalid address format. Use hexadecimal with # prefix (e.g., #F0000000)\n");
        return;
    }

