Chimipupu/rp2350_dev/src/rp2xxx_dev/dbg_com.c
    // 長さを16進数文字列から数値に変換
    if (sscanf(p_args->p_argv[2], "#%x", &length) != 1) {
        printf("Error: Invalid length format. Use hexadecimal with # prefix (e.g., #10)\n");
        return;
    }

    volatile uint32_t start_time = time_us_32();
    show_mem_dump(addr, length);
    volatile uint32_t end_time = time_us_32();
    printf("\nMemory dump completed (proc time: %u us)\n", end_time - start_time);
}

/**
 * @brief I2Cスキャンコマンド関数
 * 
 * @param p_args コマンド引数の構造体ポインタ
 */
static void cmd_i2c(const dbg_cmd_args_t* p_args)
{
    if (p_args->argc != 3) {
        printf("Error: Invalid number of arguments. Usage: i2c <port> <command>\n");
        printf("Commands:\n");
        printf("  s - Scan I2C bus for devices\n");
        return;
    }

    // I2Cポート番号を取得
    uint8_t port = atoi(p_args->p_argv[1]);
    if (port != 0 && port != 1) {
        printf("Error: Only I2C ports 0 and 1 are supported.\n");
        return;
    }

    const char* cmd = p_args->p_argv[2];

    // I2Cのポートスキャン
    if (strcmp(cmd, "s") == 0) {
        i2c_slave_scan(port);
    } else {
        printf("Error: Unknown I2C command '%s'\n", cmd);
    }
}

/**
 * @brief レジスタR/Wコマンド関数
 * 
 * @param p_args コマンド引数の構造体ポインタ
 */
static void cmd_reg(const dbg_cmd_args_t* p_args)
{
    uint32_t wval = 0;
    uint32_t val = 0;
    uint32_t addr = 0;
    uint32_t rval = 0;

    if (p_args->argc != 4 && p_args->argc != 5) {
        printf("Error: Usage: reg #ADDR r|w BITS [#VAL]\n");
        printf("  e.g. reg #F000FF00 r 8\n");
        printf("  e.g. reg #F000FF00 w 32 #FFDC008F\n");
        return;
    }

    if (sscanf(p_args->p_argv[1], "#%x", &addr) != 1) {
        printf("Error: Invalid address format. Use #HEX (e.g. #F000FF00)\n");
        return;
    }
    char rw = p_args->p_argv[2][0];
    int bits = atoi(p_args->p_argv[3]);
    if (!(bits == 8 || bits == 16 || bits == 32)) {
        printf("Error: Bit width must be 8, 16, or 32\n");
        return;
    }
    if (rw == 'r') { // 読み取り
        if (p_args->argc != 4) {
            printf("Error: Read usage: reg #ADDR r BITS\n");
            return;
        }
        // app_main.hのマクロを使用
        if (bits == 8) val = REG_READ_BYTE(0, addr);
        else if (bits == 16) val = REG_READ_WORD(0, addr);
        else if (bits == 32) val = REG_READ_DWORD(0, addr);
        printf("[REG] Read %dbit @ 0x%08X = 0x%0*X\n", bits, addr, bits / 4, val);
    } else if (rw == 'w') { // 書き込み
        sscanf(p_args->p_argv[4], "#%x", &wval);
        if (bits == 8) {
            REG_WRITE_BYTE(0, addr, (uint8_t)wval);
        } else if (bits == 16) {
            REG_WRITE_WORD(0, addr, (uint16_t)wval);
        } else if (bits == 32) {
            REG_WRITE_DWORD(0, addr, (uint32_t)wval);
        }
            printf("[REG] Write %dbit @ 0x%08X = 0x%0*X\n", bits, addr, bits / 4, wval);
    } else {
            printf("Error: 2nd arg must be 'r' or 'w'\n");
    }
}

static int get_neopixel_color_from_name(const char* name)
{
    if (strcasecmp(name, "black") == 0) return NEOPIXEL_COLOR_BLACK;
    if (strcasecmp(name, "red") == 0) return NEOPIXEL_COLOR_RED;
    if (strcasecmp(name, "green") == 0) return NEOPIXEL_COLOR_GREEN;
    if (strcasecmp(name, "blue") == 0) return NEOPIXEL_COLOR_BLUE;
    if (strcasecmp(name, "yellow") == 0) return NEOPIXEL_COLOR_YELLOW;
    if (strcasecmp(name, "cyan") == 0) return NEOPIXEL_COLOR_CYAN;
    if (strcasecmp(name, "magenta") == 0) return NEOPIXEL_COLOR_MAGENTA;
    if (strcasecmp(name, "orange") == 0) return NEOPIXEL_COLOR_ORANGE;
    if (strcasecmp(name, "purple") == 0) return NEOPIXEL_COLOR_PURPLE;
    if (strcasecmp(name, "pink") == 0) return NEOPIXEL_COLOR_PINK;
    if (strcasecmp(name, "white") == 0) return NEOPIXEL_COLOR_WHITE;
    return -1;
}

static int parse_hex_color(const char* str, uint8_t *r, uint8_t *g, uint8_t *b)
{
    if ((str == NULL) || (strlen(str) != 7) || (str[0] != '#')) {
        return -1;
    }

    uint8_t rv, gv, bv = 0;
    if (sscanf(str+1, "%02x%02x%02x", &rv, &gv, &bv) == 3) {
        *r = (uint8_t)rv;
        *g = (uint8_t)gv;
        *b = (uint8_t)bv;
        return 0;
    }
    return -1;
}

/**
 * @brief NeoPixel制御コマンド関数
 * 
 * @param p_args 
 */
static void cmd_neopixel(const dbg_cmd_args_t* p_args)
{
    uint8_t r, g, b = 0;
    int idx = 0;
    uint8_t all_set_flag = 0;
    int color_enum = 0;

    char* p_mode_str = p_args->p_argv[1];
    // 第二引数がcls
    if(strcasecmp(p_mode_str, "cls") == 0) {
        drv_neopixel_init(&s_neopixel);
        printf("All NeoPixel Cleared!\n");
        return;
    }

    if(strcasecmp(p_mode_str, "fade") == 0) {
        // Core 0にLEDフェードを実行要求
        set_multicore_fifo(PROC_NEOPIXEL_FADE);
        printf("All NeoPixel Color Fade! at Core 0\n");
        return;
    }

    // コマンド引数チェック
    if (p_args->argc < 3) {
        printf("Usage: neopixel <index|mode> <color|#RRGGBB>\n");
        return;
    }

    // 第二引数がall
    if(strcasecmp(p_mode_str, "all") == 0) {
        all_set_flag = 1;
    } else {
        idx = atoi(p_args->p_argv[1]);
        // 指定indexチェック
        if ((idx < 1) || idx > s_neopixel.led_cnt) {
            printf("Error: indexは1～%d\n", s_neopixel.led_cnt);
            return;
        }
    }

    // 第三引数が文字
    uint8_t led_idx = (uint8_t)idx - 1;
    const char* color_str = p_args->p_argv[2];
    color_enum = get_neopixel_color_from_name(color_str);
    if (color_enum >= 0) {
        if (all_set_flag != 0) {
            // 全てのNeoPixelに同じ色を設定
            for (uint8_t i = 0; i < s_neopixel.led_cnt; i++)
            {
                drv_neopixel_get_pixel_color(&s_neopixel, i, color_enum);
            }
            drv_neopixel_show(&s_neopixel);
            printf("All NeoPixels set to %s\n", color_str);
            return;
        } else {
            // 指定されたNeoPixelに色を設定
            drv_neopixel_set_pixel_color(&s_neopixel, led_idx, color_enum);
            printf("NeoPixel[%d] = %s\n", led_idx, color_str);
            return;
        }
    }

    // 第三引数が#RRGGBB形式
    if (parse_hex_color(color_str, &r, &g, &b) == 0) {
        if (all_set_flag != 0) {
            // 全てのNeoPixelに同じ色を設定
            drv_neopixel_set_all_led_color(&s_neopixel, r, g, b);
            printf("All NeoPixels set to #%02X%02X%02X\n", r, g, b);
            return;
        } else {
            drv_neopixel_set_pixel_rgb(&s_neopixel, led_idx, r, g, b);
            printf("NeoPixel[%d] = #%02X%02X%02X\n", led_idx, r, g, b);
            return;
        }
    }
}

/**
 * @brief コマンドを履歴に追加する関数
 * 
 * @param p_cmd 追加するコマンド
 */
static void add_to_cmd_history(const char* p_cmd)
{
    // 履歴を1つずつ下にずらす
    for (int32_t i = CMD_HISTORY_MAX - 1; i > 0; i--) {
        strcpy(s_cmd_history[i], s_cmd_history[i - 1]);
    }

    // 新しいコマンドを追加
    strncpy(s_cmd_history[0], p_cmd, DBG_CMD_MAX_LEN - 1);
    s_cmd_history[0][DBG_CMD_MAX_LEN - 1] = '\0';

