Chimipupu/rp2350_dev/src/rp2xxx_dev/dbg_com.c
    // 履歴数を更新（最大値で制限）
    if (s_history_count < CMD_HISTORY_MAX) {
        s_history_count++;
    }

    // 履歴位置をリセット
    s_history_pos = -1;
}

/**
 * @brief コマンド文字列を解析してコマンド種類を返す
 * 
 * @param p_cmd_str コマンド文字列
 * @param p_args 引数構造体
 * @return dbg_cmd_t コマンド種類
 */
static dbg_cmd_t dbg_com_parse_cmd(const char* p_cmd_str, dbg_cmd_args_t* p_args)
{
    for (uint8_t i = 0; i < CMD_TBL_SIZE; i++)
    {
        if (strcmp(p_cmd_str, g_cmd_tbl[i].p_cmd_str) == 0) {
            // 引数の数をチェック
            if (p_args->argc - 1 < g_cmd_tbl[i].min_args || p_args->argc - 1 > g_cmd_tbl[i].max_args) {
                printf("Error: Invalid number of arguments. Expected %d-%d, got %d\n",
                    g_cmd_tbl[i].min_args, g_cmd_tbl[i].max_args, p_args->argc - 1);
                return CMD_UNKNOWN;
            }
            return g_cmd_tbl[i].cmd_type;
        }
    }
    return CMD_UNKNOWN;
}

/**
 * @brief コマンドを実行する
 * 
 * @param cmd コマンド種類
 * @param p_args 引数構造体
 */
static void dbg_com_execute_cmd(dbg_cmd_t cmd, const dbg_cmd_args_t* p_args)
{
    switch (cmd) {
        case CMD_HELP:
            cmd_help();
            break;

        case CMD_CLS:
            cmd_cls();
            break;

        case CMD_SYSTEM:
            cmd_system();
            break;

        case CMD_MCT:
            cmd_mct_test();
            break;

        case CMD_MT_TEST:
            cmd_mt_test();
            break;

        case CMD_TIMER:
            cmd_timer(p_args);
            break;

        case CMD_GPIO:
            cmd_gpio(p_args);
            break;

        case CMD_MEM_DUMP:
            cmd_mem_dump(p_args);
            break;

        case CMD_I2C:
            cmd_i2c(p_args);
            break;

        case CMD_RST:
            cmd_rst();
            break;

        case CMD_REG:
            cmd_reg(p_args);
            break;
#if defined(MCU_RP2350)
        case CMD_RND:
            cmd_rnd(p_args);
            break;

        case CMD_SHA:
            cmd_sha(p_args);
            break;
#endif
        case CMD_NEOPIXEL:
            cmd_neopixel(p_args);
            break;

        case CMD_UNKNOWN:
        default:
            cmd_unknown();
            break;
    }
}

/**
 * @brief デバッグコマンドモニターの初期化
 */
void dbg_com_init(void)
{
    printf(ANSI_ESC_CLS);
    cmd_help();
}

/**
 * @brief デバッグコマンドモニターのメイン処理
 */
void dbg_com_main(void)
{
    dbg_cmd_args_t args;

    if (s_cmd_index >= DBG_CMD_MAX_LEN - 1) {
        s_cmd_index = 0;
    }

    int32_t c = getchar();
    // デリミタでCRかLFが来たらコマンドの受付を終わる
    if (c == '\r' || c == '\n') {
        if (s_cmd_index > 0) {
            s_cmd_buffer[s_cmd_index] = '\0';
            printf("\n");

            // コマンド履歴に入力されたコマンドを追加
            add_to_cmd_history(s_cmd_buffer);

            split_str(s_cmd_buffer, &args);
            if (args.argc > 0) {
                dbg_cmd_t cmd = dbg_com_parse_cmd(args.p_argv[0], &args);
                dbg_com_execute_cmd(cmd, &args);
            }
            s_cmd_index = 0;
            printf("> ");
        } else {
            printf("\n> ");
        }
    } else if (c == '\b' || c == KEY_BACKSPACE) {
        if (s_cmd_index > 0) {
            s_cmd_index--;
            printf("\b \b");
        }
    } else if (c == KEY_ESC) {  // ESC
        c = getchar();
        if (c == KEY_ANSI_ESC) {    // ANSI escape sequence
            c = getchar();
            if (c == KEY_UP) {  // キーボードの上矢印
                if (s_history_pos < s_history_count - 1) {
                    // 現在の入力バッファをクリア
                    while (s_cmd_index > 0) {
                        printf("\b \b");
                        s_cmd_index--;
                        WDT_RST();
                    }
                    // コマンド履歴を1つ古いものに
                    s_history_pos++;
                    strcpy(s_cmd_buffer, s_cmd_history[s_history_pos]);
                    s_cmd_index = strlen(s_cmd_buffer);
                    printf("%s", s_cmd_buffer);
                }
            } else if (c == KEY_DOWN) {  // キーボードの下矢印
                if (s_history_pos >= 0) {
                    // コマンド履歴の現在の入力バッファをクリア
                    while (s_cmd_index > 0) {
                        printf("\b \b");
                        s_cmd_index--;
                        WDT_RST();
                    }
                    // 履歴を1つ新しいものに
                    s_history_pos--;
                    if (s_history_pos < 0) {
                        s_cmd_index = 0;
                    } else {
                        strcpy(s_cmd_buffer, s_cmd_history[s_history_pos]);
                        s_cmd_index = strlen(s_cmd_buffer);
                        printf("%s", s_cmd_buffer);
                    }
                }
            }
        }
    } else if (c >= ' ' && c <= '~') {
        s_cmd_buffer[s_cmd_index++] = c;
        putchar(c);
    }
}